; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v6 - type_1 ?v8 - type_2)
 	      (pred_2 ?v3 - object ?v8 - type_2)
	      (pred_1 ?v6 - type_1 ?v7 - type_3)
	      (pred_4 ?v6 - type_1 ?v3 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v6 - type_1 ?v4 ?v1 - type_2)
       :precondition (and  (pred_3 ?v6 ?v4))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_1 ?v2 - object ?v5 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v5) (pred_3 ?v6 ?v5) (pred_1 ?v6 ?v7))
       :effect (and (pred_4 ?v6 ?v2 ?v7)
		    (not (pred_2 ?v2 ?v5)) 
		    (not (pred_1 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_1 ?v2 - object ?v5 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v2 ?v7) (pred_3 ?v6 ?v5))
       :effect (and (pred_2 ?v2 ?v5)
		    (pred_1 ?v6 ?v7)
		    (not (pred_4 ?v6 ?v2 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_02 obj_10 - type_1
obj_04 obj_11 obj_09 obj_05 - type_3
obj_13 obj_01 obj_08 obj_03 - type_2
obj_12 obj_06 obj_07 - object)
(:init
(pred_3 obj_02 obj_08)
(pred_1 obj_02 obj_04)
(pred_1 obj_02 obj_11)
(pred_3 obj_10 obj_03)
(pred_1 obj_10 obj_09)
(pred_1 obj_10 obj_05)
(pred_2 obj_12 obj_03)
(pred_2 obj_06 obj_08)
(pred_2 obj_07 obj_01)
)
(:goal
(and
(pred_2 obj_12 obj_01)
(pred_2 obj_06 obj_01)
(pred_2 obj_07 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_02 obj_01) (pred_3 obj_10 obj_01))))
    (always (not (and (pred_3 obj_02 obj_03) (pred_3 obj_10 obj_03))))
  )
)
)

; plan
1. (op_2 obj_02 obj_08 obj_13)
   deleted: (pred_3 obj_02 obj_08)
   added: (pred_3 obj_02 obj_13)
   goals met: 0 of 3
2. (op_1 obj_10 obj_12 obj_03 obj_05)
   deleted: (pred_2 obj_12 obj_03) (pred_1 obj_10 obj_05)
   added: (pred_4 obj_10 obj_12 obj_05)
   goals met: 0 of 3
3. (op_2 obj_02 obj_13 obj_01)
   deleted: (pred_3 obj_02 obj_13)
   added: (pred_3 obj_02 obj_01)
   goals met: 0 of 3
4. (op_2 obj_10 obj_03 obj_08)
   deleted: (pred_3 obj_10 obj_03)
   added: (pred_3 obj_10 obj_08)
   goals met: 0 of 3
5. (op_1 obj_02 obj_07 obj_01 obj_11)
   deleted: (pred_2 obj_07 obj_01) (pred_1 obj_02 obj_11)
   added: (pred_4 obj_02 obj_07 obj_11)
   goals met: 0 of 3
6. (op_1 obj_10 obj_06 obj_08 obj_09)
   deleted: (pred_2 obj_06 obj_08) (pred_1 obj_10 obj_09)
   added: (pred_4 obj_10 obj_06 obj_09)
   goals met: 0 of 3
7. (op_2 obj_02 obj_01 obj_03)
   deleted: (pred_3 obj_02 obj_01)
   added: (pred_3 obj_02 obj_03)
   goals met: 0 of 3
8. (op_2 obj_10 obj_08 obj_01)
   deleted: (pred_3 obj_10 obj_08)
   added: (pred_3 obj_10 obj_01)
   goals met: 0 of 3
9. (op_3 obj_02 obj_07 obj_03 obj_11)
   deleted: (pred_4 obj_02 obj_07 obj_11)
   added: (pred_2 obj_07 obj_03) (pred_1 obj_02 obj_11)
   goals met: 1 of 3
10. (op_3 obj_10 obj_06 obj_01 obj_09)
   deleted: (pred_4 obj_10 obj_06 obj_09)
   added: (pred_2 obj_06 obj_01) (pred_1 obj_10 obj_09)
   goals met: 2 of 3
11. (op_3 obj_10 obj_12 obj_01 obj_05)
   deleted: (pred_4 obj_10 obj_12 obj_05)
   added: (pred_2 obj_12 obj_01) (pred_1 obj_10 obj_05)
   goals met: 3 of 3
